Submitted by :- 
Name - Omm Tripathi | 
Roll No - 23051606 | 
Section - CSE-35 | 
Lab - 5 |
Assignment- 0.61

In [2]:
import numpy as np
import pandas as pd

-----------------------------------------------------------------------------------

1. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [3]:
s1  = [1,2,3,4,5,6]
s2  = [7,8,9,10,11,12]

st1 = pd.Series(s1)
st2 = pd.Series(s2)

# print("Series1:",st1)
# print("Series2:",st2)

print("Add:",st1+st2,end='')
print("Subtraction:",st2-st1,end='')
print("Multiplication:",st1*st2,end='')
print("Division:",st2/st1,end='')

Add: 0     8
1    10
2    12
3    14
4    16
5    18
dtype: int64Subtraction: 0    6
1    6
2    6
3    6
4    6
5    6
dtype: int64Multiplication: 0     7
1    16
2    27
3    40
4    55
5    72
dtype: int64Division: 0    7.0
1    4.0
2    3.0
3    2.5
4    2.2
5    2.0
dtype: float64

-----------------------------------------------------------------------------------

2. Write a Pandas program to convert a dictionary to a Pandas series.

In [9]:
dict1 = {"Akshay":90,"Hardik":98,"Srija":89,"Jayant":96,"Karan":94}
sdict = pd.Series(dict1)
print(sdict)

Akshay    90
Hardik    98
Srija     89
Jayant    96
Karan     94
dtype: int64

-----------------------------------------------------------------------------------

3. Write a Pandas program to convert a NumPy array to a Pandas series.

In [10]:
s1  = np.array([10,11,12,13,14,15,16,17,18,19,20])
st1 = pd.Series(s1)
print(st1)

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
dtype: int64

-----------------------------------------------------------------------------------

4. Write a Pandas program to convert a given Series to an array.

In [16]:
dt = pd.Series([1,2,3,4,5,6,7,8,9])
print(dt)
arr1 = dt.values
print(arr1)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
[1 2 3 4 5 6 7 8 9]

-----------------------------------------------------------------------------------

5. Write a Pandas program to convert Series of lists to one Series.

In [22]:
s1 = pd.Series([[1,2,3,4,5,6,7],[2,3,5,4,6,7,3,6,7,8],[2,4,2,5,8,4,3]])
# arr1 =  s1.values
# merge = []
# for i in range(len(arr1)):
#     merge.extend(arr1[i])

# st1 = pd.Series(merge)
# print(st1)

# the pandas way
st1 = s1.explode().reset_index(drop=True)
print(st1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     2
8     3
9     5
10    4
11    6
12    7
13    3
14    6
15    7
16    8
17    2
18    4
19    2
20    5
21    8
22    4
23    3
dtype: object

-----------------------------------------------------------------------------------

6. Write a Pandas program to create a dataframe from a dictionary and display it

In [23]:
dict1 = {
    "name":['Akshay','Hardik','Kajal','Jyoti'],
    "rollno":[1001,1002,1003,1004],
    "marks":[98,89,92,93]
}
sdict = pd.DataFrame(dict1)
print(sdict)

     name  rollno  marks
0  Akshay    1001     98
1  Hardik    1002     89
2   Kajal    1003     92
3   Jyoti    1004     93

-----------------------------------------------------------------------------------

7. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [34]:
data = {
    "name": ["Jay", "Hariom", "Kali","Tilak","Ayushmaan","Nandi"],
    "age": [20,21,22,23,24,25],
    "marks": [85,90,88,90,98,97]
}

dt = pd.DataFrame(data)
dt[0:3:]

     name  age  marks
0     Jay   20     85
1  Hariom   21     90
2    Kali   22     88

-----------------------------------------------------------------------------------

8. Write a Pandas program to select the 'name' and 'score' columns from the following


exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 

'Michael', 'Matthew', 'Laura',

'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Expected Output:

Select specific columns:

name score

a Anastasia 12.5

b Dima 9.0

c Katherine 16.5

... h Laura NaN

i Kevin 8.0

j Jonas 19.0

-----------------------------------------------------------------------------------

In [37]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index=labels)
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

-----------------------------------------------------------------------------------

9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN. Sample Python dictionary data and list labels:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 

'Michael', 'Matthew', 'Laura',

'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Expected Output:

Rows where score is missing:

attempts name qualify score

d 3 James no NaN

h 1 Laura no NaN

In [39]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index=labels)
df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

-----------------------------------------------------------------------------------

10. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now

delete the new row and return the original DataFrame. Sample Python dictionary 

data and list labels:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 

'Michael', 'Matthew', 'Laura',

'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Values for each column will be:


name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k" Expected 

Output:
Append a new row:

Print all records after insert a new record:

attempts name qualify score

a 1 Anastasia yes 12.5

b 3 Dima no 9.0

...... j 1 Jonas yes 19.0

k 1 Suresh yes 15.5

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index=labels)
df.loc['k'] = ['Suresh',15.5,1,'yes']
print(df)

df = df.drop('k')

print("\nDataFrame after deleting the new row:\n")
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

DataFrame after deleting the new row:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

-----------------------------------------------------------------------------------